## Lab/HW Day 3 - Due on Day 4 before lunch. 
## Cleaning of Titanic dataset.

Description on the features/columns.

- `survived`: A boolean where 0 = No and 1 = Yes

- `pclass`: Ticket class 1 = 1st class, 2 = 2nd class, 3 = 3rd class
    - `pclass` is often a proxy for socio-economic status (SES):
           - 1st = Upper
           - 2nd = Middle
           - 3rd = Lower
- `name`: Name of the passenger
- `gender`: "male" or "female"
- `age`: Passenger age in years	(Age is fractional if less than 1)
- `sibsp`: Number of siblings / spouses aboard the Titanic
     - The dataset defines family relations in this way: Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife (fianc√©s were ignored)
- `parch`: Number of parents / children aboard the Titanic
      - The dataset defines family relations in this way: Parent = mother, father
      - Child = daughter, son, stepdaughter, stepson
      - Some children travelled only with a nanny, therefore parch=0 for them.
- `ticket`: Ticket number	
- `fare`: Passenger fare for ticket
- `cabin`: Cabin number	
- `embarked`: Port of Embarkation
    - C = Cherbourg
    - Q = Queenstown
    - S = Southampton

In [5]:
# important imports
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

**Read the given datafile `titanic.csv`**

In [6]:
titanic = pd.read_csv('titanic.csv')

**What is the shape of your dataset.**

In [1]:
# CDOE HERE PLEASE
titanic.shape

NameError: name 'titanic' is not defined

In [5]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

(891, 11)

**Get first 6 lines of your dataframe**.

In [6]:
# CDOE HERE PLEASE

In [41]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.00000,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00000,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.00000,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00000,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.00000,0,0,373450,8.0500,S
5,0,3,"Moran, Mr. James",male,25.14062,0,0,330877,8.4583,Q

In [7]:
titanic.sample() # alwasy good to know little more:) re-run this again and notice the difference

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
245,0,1,"Minahan, Dr. William Edward",male,44.0,2,0,19928,90.0,C78,Q

**How to get the summary on your dataset.**

In [8]:
# CDOE HERE PLEASE

In [9]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
survived    891 non-null int64
pclass      891 non-null int64
name        891 non-null object
gender      891 non-null object
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
ticket      891 non-null object
fare        891 non-null float64
cabin       204 non-null object
embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

**Well, statistical summary is important, how to get it!.**

In [10]:
# CDOE HERE PLEASE

In [11]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

**Finding the unique values in a column or series.**

In [12]:
titanic['gender'].unique()

array(['male', 'female'], dtype=object)

**Finding the number of unique values in a column or series**

In [13]:
titanic['gender'].nunique()

2

**Finding the number of unique values in each column/series by looping through the entire dataframe.**

In [14]:
for col in titanic:
    print(col, titanic[col].nunique())

survived 2
pclass 3
name 891
gender 2
age 88
sibsp 7
parch 7
ticket 681
fare 248
cabin 147
embarked 3

**How to check if there are any duplicated in a column, let's try on `name` column.**

In [15]:
titanic['name'].duplicated().sum()

0

**Please get the datatypes of each column.**

In [16]:
# CODE HERE PLEASE

In [17]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

survived      int64
pclass        int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
cabin        object
embarked     object
dtype: object

In [18]:
# good to know little more
#Return a subset of the DataFrame's columns based on the column dtypes.
titanic.select_dtypes(include='object').head(2)

,name,gender,ticket,cabin,embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C

In [19]:
# same as above, only excluding object datatypes
titanic.select_dtypes(exclude=['object']).head(2)

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833

**How many data points are missing in the respective columns.**

In [20]:
# CODE HERE PLEASE

In [21]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

survived      0
pclass        0
name          0
gender        0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      2
dtype: int64

**What is the percentage of missing data in each column?**

In [22]:
# CODE HERE PLEASE

In [23]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

survived     0.000000
pclass       0.000000
name         0.000000
gender       0.000000
age         19.865320
sibsp        0.000000
parch        0.000000
ticket       0.000000
fare         0.000000
cabin       77.104377
embarked     0.224467
dtype: float64

#### Now what to do with these missing values? Any idea? 

- ignore them
- delete rows
- delete an entire column
- imputation
- do some research (if possible)

**Let's see how many people embarked from each port, this might help us to fill the two missing data points in embarked column!**<br> *Hint: `value_counts()`*

In [24]:
# CODE HERE PLEASE

In [25]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

S    644
C    168
Q     77
Name: embarked, dtype: int64

**Fill the missing data in `embarked` column with the busiest port. This seems a good idea, right?**

In [26]:
# CODE HERE PLEASE

In [27]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

**Re-check the missing data.**

In [28]:
titanic.isnull().sum()
#titanic["embarked"].isnull().sum()

survived      0
pclass        0
name          0
gender        0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      0
dtype: int64

Notice, embarked column has no more missing data!

**Get the names of all the columns in your dataframe.**

In [29]:
# CODE HERE PLEASE

In [30]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

Index(['survived', 'pclass', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

**The Cabin column has a high percentage of NaN values, so this could be a situation where one could consider dropping the entire column. Let's drop the `cabin` column.**

In [31]:
# CODE HERE PLEASE

In [32]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

**Get the names of the columns again and confirm if the `cabin` column is dropped.**

In [33]:
# CODE HERE PLEASE

In [34]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

Index(['survived', 'pclass', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked'],
      dtype='object')

**Now, the only column with missing data is `age`, we can think about grouping the data here.**
* Group the data by `pclass` and find the mean age (you can think about median as well).

In [35]:
# CODE HERE PLEASE

In [36]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

pclass
1    38.233441
2    29.877630
3    25.140620
Name: age, dtype: float64

Notice above, the mean age makes some sense. Most of the time money comes with age, right? So, we can think about filling the age column with the mean values based on the `Pclass`.

**[Bonus Question]  Let's fill the missing data in `age` column with the mean value for each `Pclass`.**

In [37]:
# CODE HERE PLEASE

In [38]:
# NO CODE IN THIS CELL PLEASE, YOU WILL LOSE THE OUTPUT IF YOU RUN THIS CELL

,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

**Notice from the outputs below, we have fixed the `age` columns as well, there is no missing data in the age column.**

In [39]:
print(titanic['age'].isnull().sum())
#titanic['age'].mean()

0

In [40]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
survived    891 non-null int64
pclass      891 non-null int64
name        891 non-null object
gender      891 non-null object
age         891 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
ticket      891 non-null object
fare        891 non-null float64
embarked    891 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB